In [2]:
#generate gaussian data sample
from numpy.random import seed
from numpy.random import randn
from numpy import mean
from numpy import std
#seed the random number generator
seed(10)
# generate two sets of unvariate observation
A= 5* randn(100) +50
B= 5* randn(100)+52
#summarize
print('A : Mean=%.3f stdv=%.3f'%(mean(A),std(A))) 
print('B : Mean=%.3f stdv=%.3f'%(mean(B),std(B)))

A : Mean=50.397 stdv=4.835
B : Mean=52.346 stdv=4.927

In [3]:
A

array([56.65793252, 53.57639487, 42.27299854, 49.95808075, 53.10667987,
       46.3995722 , 51.32755793, 50.54274263, 50.02145715, 49.12699895,
       52.16513095, 56.01518687, 45.17467165, 55.14137039, 51.14315065,
       52.22568806, 44.31698894, 50.67568439, 57.42268501, 44.60097557,
       40.1113586 , 41.28313852, 51.33035082, 61.92483665, 55.61845627,
       58.36311107, 50.49574608, 56.98998189, 48.64376006, 53.06602092,
       48.66341406, 47.25345493, 50.66354148, 47.61928993, 56.5423654 ,
       50.9750664 , 52.00104994, 48.31183831, 56.28236132, 46.34015249,
       53.30115776, 48.24564054, 45.3028332 , 47.55331392, 45.97704429,
       48.93651181, 48.30429877, 51.56084968, 52.82576335, 49.26289871,
       49.87047332, 51.44547102, 47.30060464, 53.5408001 , 54.21112369,
       51.01790399, 61.97351832, 54.58729469, 49.43863764, 48.18909776,
       48.83908872, 47.4913555 , 55.64392577, 46.51094985, 49.59438908,
       47.3535196 , 55.23091428, 42.90721985, 48.18750408, 49.39047154,
       51.59678211, 52.30451451, 48.92105054, 54.94536229, 51.57376889,
       62.33825528, 42.45839256, 53.10300332, 44.77433731, 46.00995591,
       59.92542296, 58.72407074, 40.7190726 , 48.8861315 , 49.67076076,
       39.34143946, 49.75584744, 51.96670609, 51.08632573, 40.02803115,
       55.53854117, 51.22271988, 49.69043985, 46.2305352 , 53.55979508,
       54.59134576, 47.58953431, 50.44793806, 54.13499311, 40.2274394 ])

In [4]:
from statsmodels.stats.weightstats import ztest

In [5]:
ztest(A,B)

(-2.809121762113397, 0.004967685420845533)

In [7]:
stats,p_value=ztest(A,B)

In [8]:
p_value

0.004967685420845533

In [9]:
signiface_value=0.05
#H0 : Both data are same
#H1 : Both are no same
if p_value<0.05:
    print("H0 is rejected")
else:
    print("H0 is accepted")

H0 is rejected

In [18]:
#H0 : Both data are same
#H1 : Both are no same
from scipy.stats import ttest_rel
#compare samples
stat,p=ttest_ind(A,B)
print("Statisticals=%.3f,p=%.3f" %(stat,p))
#interpret
alpha=0.05
if p_value<alpha:
    print("H0 is rejected")
else:
    print("H0 is accepted")

Statisticals=-2.809,p=0.005
H0 is rejected

In [20]:
#paired student's t-test
from numpy.random import seed
from numpy.random import randn
from scipy.stats import ttest_rel
#seed the random number generator
seed(1)
#generate two independent samples
data1= 5 * randn(100)+50
data2= 5 * randn(100)+58
#campare samples
stat,p=ttest_rel(data1,data2)
print("Statistics=%.3f,p=%.3f" %(stat,p))
#interpret
alpha=0.05
if p>alpha:
    print("same distribution (fall to reject H0)")
else:
    print("different distribution (reject H0)")

Statistics=-13.736,p=0.000
different distribution (reject H0)

In [17]:
'''Analysis of Variable Test
The one-way analysis of variance (ANOVA) is used to determine wheather there are any statistically significant data of three or more independent(unrelated) group
H0: All 3 distributions are same. 
H1: all distribution are not same '''

'Analysis of Variable Test\nThe one-way analysis of variance (ANOVA) is used to determine wheather there are any statistically significant data of three or more independent(unrelated) group\nH0: All 3 distributions are same. \nH1: all distribution are not same '

In [23]:
#analysos of variance test
from numpy.random import seed
from numpy.random import randn
from scipy.stats import f_oneway
#seed the random number generator
seed(1)
#generarte three independent samples
data1= 5 * randn(100)+50
data2= 5 * randn(100)+52
data3= 5 * randn(100)+50
#compare samples
stat,p=f_oneway(data1,data2,data3)
print('statistics=%.3f,p=%.3f' %(stat,p))
#interpret
alpha=0.05
if p>alpha:
    print("Same distribution (fall to reject H0)")
else:
    print("Different distribution (reject H0)")

statistics=10.035,p=0.000
Different distribution (reject H0)

In [24]:
''' Chi Square Test for Categorical Features 
Chi-Square test is used for categorical features in a dataset. We calculate Chi-Square between each feature and desired number of features with best Chi-square scores. It determines if the association between two categorical would reflect their real association in the population '''

' Chi Square Test for Categorical Features \nChi-Square test is used for categorical features in a dataset. We calculate Chi-Square between each feature and desired number of features with best Chi-square scores. It determines if the association between two categorical would reflect their real association in the population '

In [31]:
#load libraries 
from sklearn.datasets import load_iris
from sklearn.feature_selection import SelectKBest
from sklearn.feature_selection import chi2
#load iris data
iris_dataset = load_iris()
#create features and target
X=iris_dataset.data
y=iris_dataset.target
#convert to categorical data by converting data to integers
X=X.astype(int)
#two features with highest chi-squared statistics are selected
chi2_features= SelectKBest(chi2, k=2)
X_kbest_features=chi2_features.fit_transform(X,y)
#Reduce features
print('Original feature number :',X.shape[1])
print("Reduced feature :",X_kbest_features.shape[1])

Original feature number : 4
Reduced feature : 2

In [32]:
iris_dataset

{'data': array([[5.1, 3.5, 1.4, 0.2],
        [4.9, 3. , 1.4, 0.2],
        [4.7, 3.2, 1.3, 0.2],
        [4.6, 3.1, 1.5, 0.2],
        [5. , 3.6, 1.4, 0.2],
        [5.4, 3.9, 1.7, 0.4],
        [4.6, 3.4, 1.4, 0.3],
        [5. , 3.4, 1.5, 0.2],
        [4.4, 2.9, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.1],
        [5.4, 3.7, 1.5, 0.2],
        [4.8, 3.4, 1.6, 0.2],
        [4.8, 3. , 1.4, 0.1],
        [4.3, 3. , 1.1, 0.1],
        [5.8, 4. , 1.2, 0.2],
        [5.7, 4.4, 1.5, 0.4],
        [5.4, 3.9, 1.3, 0.4],
        [5.1, 3.5, 1.4, 0.3],
        [5.7, 3.8, 1.7, 0.3],
        [5.1, 3.8, 1.5, 0.3],
        [5.4, 3.4, 1.7, 0.2],
        [5.1, 3.7, 1.5, 0.4],
        [4.6, 3.6, 1. , 0.2],
        [5.1, 3.3, 1.7, 0.5],
        [4.8, 3.4, 1.9, 0.2],
        [5. , 3. , 1.6, 0.2],
        [5. , 3.4, 1.6, 0.4],
        [5.2, 3.5, 1.5, 0.2],
        [5.2, 3.4, 1.4, 0.2],
        [4.7, 3.2, 1.6, 0.2],
        [4.8, 3.1, 1.6, 0.2],
        [5.4, 3.4, 1.5, 0.4],
        [5.2, 4.1, 1.5, 0.1],
        [5.5, 4.2, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.2],
        [5. , 3.2, 1.2, 0.2],
        [5.5, 3.5, 1.3, 0.2],
        [4.9, 3.6, 1.4, 0.1],
        [4.4, 3. , 1.3, 0.2],
        [5.1, 3.4, 1.5, 0.2],
        [5. , 3.5, 1.3, 0.3],
        [4.5, 2.3, 1.3, 0.3],
        [4.4, 3.2, 1.3, 0.2],
        [5. , 3.5, 1.6, 0.6],
        [5.1, 3.8, 1.9, 0.4],
        [4.8, 3. , 1.4, 0.3],
        [5.1, 3.8, 1.6, 0.2],
        [4.6, 3.2, 1.4, 0.2],
        [5.3, 3.7, 1.5, 0.2],
        [5. , 3.3, 1.4, 0.2],
        [7. , 3.2, 4.7, 1.4],
        [6.4, 3.2, 4.5, 1.5],
        [6.9, 3.1, 4.9, 1.5],
        [5.5, 2.3, 4. , 1.3],
        [6.5, 2.8, 4.6, 1.5],
        [5.7, 2.8, 4.5, 1.3],
        [6.3, 3.3, 4.7, 1.6],
        [4.9, 2.4, 3.3, 1. ],
        [6.6, 2.9, 4.6, 1.3],
        [5.2, 2.7, 3.9, 1.4],
        [5. , 2. , 3.5, 1. ],
        [5.9, 3. , 4.2, 1.5],
        [6. , 2.2, 4. , 1. ],
        [6.1, 2.9, 4.7, 1.4],
        [5.6, 2.9, 3.6, 1.3],
        [6.7, 3.1, 4.4, 1.4],
        [5.6, 3. , 4.5, 1.5],
        [5.8, 2.7, 4.1, 1. ],
        [6.2, 2.2, 4.5, 1.5],
        [5.6, 2.5, 3.9, 1.1],
        [5.9, 3.2, 4.8, 1.8],
        [6.1, 2.8, 4. , 1.3],
        [6.3, 2.5, 4.9, 1.5],
        [6.1, 2.8, 4.7, 1.2],
        [6.4, 2.9, 4.3, 1.3],
        [6.6, 3. , 4.4, 1.4],
        [6.8, 2.8, 4.8, 1.4],
        [6.7, 3. , 5. , 1.7],
        [6. , 2.9, 4.5, 1.5],
        [5.7, 2.6, 3.5, 1. ],
        [5.5, 2.4, 3.8, 1.1],
        [5.5, 2.4, 3.7, 1. ],
        [5.8, 2.7, 3.9, 1.2],
        [6. , 2.7, 5.1, 1.6],
        [5.4, 3. , 4.5, 1.5],
        [6. , 3.4, 4.5, 1.6],
        [6.7, 3.1, 4.7, 1.5],
        [6.3, 2.3, 4.4, 1.3],
        [5.6, 3. , 4.1, 1.3],
        [5.5, 2.5, 4. , 1.3],
        [5.5, 2.6, 4.4, 1.2],
        [6.1, 3. , 4.6, 1.4],
        [5.8, 2.6, 4. , 1.2],
        [5. , 2.3, 3.3, 1. ],
        [5.6, 2.7, 4.2, 1.3],
        [5.7, 3. , 4.2, 1.2],
        [5.7, 2.9, 4.2, 1.3],
        [6.2, 2.9, 4.3, 1.3],
        [5.1, 2.5, 3. , 1.1],
        [5.7, 2.8, 4.1, 1.3],
        [6.3, 3.3, 6. , 2.5],
        [5.8, 2.7, 5.1, 1.9],
        [7.1, 3. , 5.9, 2.1],
        [6.3, 2.9, 5.6, 1.8],
        [6.5, 3. , 5.8, 2.2],
        [7.6, 3. , 6.6, 2.1],
        [4.9, 2.5, 4.5, 1.7],
        [7.3, 2.9, 6.3, 1.8],
        [6.7, 2.5, 5.8, 1.8],
        [7.2, 3.6, 6.1, 2.5],
        [6.5, 3.2, 5.1, 2. ],
        [6.4, 2.7, 5.3, 1.9],
        [6.8, 3. , 5.5, 2.1],
        [5.7, 2.5, 5. , 2. ],
        [5.8, 2.8, 5.1, 2.4],
        [6.4, 3.2, 5.3, 2.3],
        [6.5, 3. , 5.5, 1.8],
        [7.7, 3.8, 6.7, 2.2],
        [7.7, 2.6, 6.9, 2.3],
        [6. , 2.2, 5. , 1.5],
        [6.9, 3.2, 5.7, 2.3],
        [5.6, 2.8, 4.9, 2. ],
        [7.7, 2.8, 6.7, 2. ],
        [6.3, 2.7, 4.9, 1.8],
        [6.7, 3.3, 5.7, 2.1],
        [7.2, 3.2, 6. , 1.8],
        [6.2, 2.8, 4.8, 1.8],
        [6.1, 3. , 4.9, 1.8],
        [6.4, 2.8, 5.6, 2.1],
        [7.2, 3. , 5.8, 1.6],
        [7.4, 2.8, 6.1, 1.9],
        [7.9, 3.8, 6.4, 2. ],
        [6.4, 2.8, 5.6, 2.2],
        [6.3, 2.8, 5.1, 1.5],
        [6.1, 2.6, 5.6, 1.4],
        [7.7, 3. , 6.1, 2.3],
        [6.3, 3.4, 5.6, 2.4],
        [6.4, 3.1, 5.5, 1.8],
        [6. , 3. , 4.8, 1.8],
        [6.9, 3.1, 5.4, 2.1],
        [6.7, 3.1, 5.6, 2.4],
        [6.9, 3.1, 5.1, 2.3],
        [5.8, 2.7, 5.1, 1.9],
        [6.8, 3.2, 5.9, 2.3],
        [6.7, 3.3, 5.7, 2.5],
        [6.7, 3. , 5.2, 2.3],
        [6.3, 2.5, 5. , 1.9],
        [6.5, 3. , 5.2, 2. ],
        [6.2, 3.4, 5.4, 2.3],
        [5.9, 3. , 5.1, 1.8]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]),
 'frame': None,
 'target_names': array(['setosa', 'versicolor', 'virginica'], dtype='<U10'),
 'DESCR': '.. _iris_dataset:\n\nIris plants dataset\n--------------------\n\n**Data Set Characteristics:**\n\n:Number of Instances: 150 (50 in each of three classes)\n:Number of Attributes: 4 numeric, predictive attributes and the class\n:Attribute Information:\n    - sepal length in cm\n    - sepal width in cm\n    - petal length in cm\n    - petal width in cm\n    - class:\n            - Iris-Setosa\n            - Iris-Versicolour\n            - Iris-Virginica\n\n:Summary Statistics:\n\n============== ==== ==== ======= ===== ====================\n                Min  Max   Mean    SD   Class Correlation\n============== ==== ==== ======= ===== ====================\nsepal length:   4.3  7.9   5.84   0.83    0.7826\nsepal width:    2.0  4.4   3.05   0.43   -0.4194\npetal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\npetal width:    0.1  2.5   1.20   0.76    0.9565  (high!)\n============== ==== ==== ======= ===== ====================\n\n:Missing Attribute Values: None\n:Class Distribution: 33.3% for each of 3 classes.\n:Creator: R.A. Fisher\n:Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n:Date: July, 1988\n\nThe famous Iris database, first used by Sir R.A. Fisher. The dataset is taken\nfrom Fisher\'s paper. Note that it\'s the same as in R, but not as in the UCI\nMachine Learning Repository, which has two wrong data points.\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\n.. dropdown:: References\n\n  - Fisher, R.A. "The use of multiple measurements in taxonomic problems"\n    Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n    Mathematical Statistics" (John Wiley, NY, 1950).\n  - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.\n    (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n  - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n    Structure and Classification Rule for Recognition in Partially Exposed\n    Environments".  IEEE Transactions on Pattern Analysis and Machine\n    Intelligence, Vol. PAMI-2, No. 1, 67-71.\n  - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n    on Information Theory, May 1972, 431-433.\n  - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n    conceptual clustering system finds 3 classes in the data.\n  - Many, many more ...\n',
 'feature_names': ['sepal length (cm)',
  'sepal width (cm)',
  'petal length (cm)',
  'petal width (cm)'],
 'filename': 'iris.csv',
 'data_module': 'sklearn.datasets.data'}

In [33]:
X_kbest_features.shape

(150, 2)

In [34]:
X_kbest_features

array([[1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [3, 1],
       [4, 1],
       [3, 1],
       [3, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [3, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [3, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [5, 1],
       [4, 1],
       [3, 1],
       [3, 1],
       [3, 1],
       [3, 1],
       [5, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [3, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [4, 1],
       [3, 1],
       [4, 1],
       [6, 2],
       [5, 1],
       [5, 2],
       [5, 1],
       [5, 2],
       [6, 2],
       [4, 1],
       [6, 1],
       [5, 1],
       [6, 2],
       [5, 2],
       [5, 1],
       [5, 2],
       [5, 2],
       [5, 2],
       [5, 2],
       [5, 1],
       [6, 2],
       [6, 2],
       [5, 1],
       [5, 2],
       [4, 2],
       [6, 2],
       [4, 1],
       [5, 2],
       [6, 1],
       [4, 1],
       [4, 1],
       [5, 2],
       [5, 1],
       [6, 1],
       [6, 2],
       [5, 2],
       [5, 1],
       [5, 1],
       [6, 2],
       [5, 2],
       [5, 1],
       [4, 1],
       [5, 2],
       [5, 2],
       [5, 2],
       [5, 1],
       [5, 2],
       [5, 2],
       [5, 2],
       [5, 1],
       [5, 2],
       [5, 2],
       [5, 1]])

In [35]:
data=[['alex',10,'maths'],['bob',12,'science'],['kelly',15,'eco'],['boris',14,'geo'],['ken',18,'english']]

In [36]:
data

[['alex', 10, 'maths'],
 ['bob', 12, 'science'],
 ['kelly', 15, 'eco'],
 ['boris', 14, 'geo'],
 ['ken', 18, 'english']]

In [37]:
import pandas as pd
d=pd.DataFrame(data,columns=['Name','Age','Subjects'])
d

    Name  Age Subjects
0   alex   10    maths
1    bob   12  science
2  kelly   15      eco
3  boris   14      geo
4    ken   18  english

In [38]:
d.Name

0     alex
1      bob
2    kelly
3    boris
4      ken
Name: Name, dtype: object

In [39]:
d['Name']

0     alex
1      bob
2    kelly
3    boris
4      ken
Name: Name, dtype: object

In [40]:
d['Age']

0    10
1    12
2    15
3    14
4    18
Name: Age, dtype: int64

In [41]:
d[['Age','Name']]

   Age   Name
0   10   alex
1   12    bob
2   15  kelly
3   14  boris
4   18    ken

In [47]:
d[['Age','Name']]

   Age   Name
0   10   alex
1   12    bob
2   15  kelly
3   14  boris
4   18    ken

In [48]:
d.iloc[0,0]

'alex'

In [51]:
d.iloc[4,2]

'english'

In [53]:
d.iloc[2,0]='sun'
d

    Name  Age Subjects
0   alex   10    maths
1    bob   12  science
2    sun   15      eco
3  boris   14      geo
4    ken   18  english

In [54]:
d.iloc[0,0]='ema'
d

    Name  Age Subjects
0    ema   10    maths
1    bob   12  science
2    sun   15      eco
3  boris   14      geo
4    ken   18  english

In [55]:
#d.iloc[row_start,row_end,row_step col_start,col_end,col_step]
d.iloc[[3,1],[0,1]]

    Name  Age
3  boris   14
1    bob   12

In [56]:
d.iloc[1:3,[0,1]]

  Name  Age
1  bob   12
2  sun   15

In [59]:
## loc will worl on rows as well as names of columns
d.loc[:2,['Name','Subjects']]

  Name Subjects
0  ema    maths
1  bob  science
2  sun      eco

In [60]:
d.loc[3]

Name        boris
Age            14
Subjects      geo
Name: 3, dtype: object

In [1]:
data

NameError: name 'data' is not defined